# DirectShapeReferenceOptions Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
DirectShapeReferenceOptions Class
Members See Also
---
This class is used to control the behavior of DirectShape and DirectShapeType reference objects.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public class DirectShapeReferenceOptions : IDisposable
```

Visual Basic
---
```text
Public Class DirectShapeReferenceOptions _
	Implements IDisposable
```

Visual C++
---
```text
public ref class DirectShapeReferenceOptions : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..DirectShapeReferenceOptions
# See Also
DirectShapeReferenceOptions Members
Autodesk.Revit.DB Namespace